---
kind: method
id: M:Autodesk.Revit.DB.Definitions.Dispose
source: html/507ac5bd-e394-8141-eaf6-0021707965af.htm
---
# Autodesk.Revit.DB.Definitions.Dispose Method

Releases all resources used by the Definitions

## Syntax (C#)
```csharp
public void Dispose()
```